{
  "marriage": [
    "Why did the zombies get divorced? Their marriage was dead.",
    "Why did the lion go to therapy? He found out his wife was a cheetah.",
    "Keep your eyes wide open before marriage and half shut afterward.",
    "Q: 'Aren’t you wearing your ring on the wrong finger?' A: 'Yes, I’m married to the wrong man.'",
    "My wife ran off with my best friend last year. I still miss him.",
    "Get a new car for your spouse. It’ll be a great trade.",
    "Did you hear about the couple of bed bugs? They got married in the spring.",
    "Taking my husband’s name wasn’t a feminist act. I just don’t want anyone I went to high school with to find me.",
    "Any man getting married should forget his mistakes. There’s no reason two people should remember them in detail.",
    "What’s the difference between 'incomplete' and 'finished'? A man without a wife feels incomplete. Once he’s married, he’s finished.",
    "Wife: I love you. Husband: Is that you or the wine talking? Wife: It’s me talking. To the wine.",
    "What’s the difference between love and marriage? Love is blind. Marriage is eye-opening.",
    "Which one of your kids will never grow up and move out? Your husband.",
    "How does a man satisfy his wife in bed? By sleeping on the sofa.",
    "My husband told me to do whatever makes me happy. I’ll miss him.",
    "My wife is mad I ruined our anniversary, which is odd. I don’t even know when it is.",
    "Why is being married worse than going to work? At least at work, you might get a new boss.",
    "My husband is driving me to drink. It’s better than taking an Uber.",
    "How are husbands like wine? They take years and years and years to mature.",
    "My husband told me I’m a know-it-all. I told him I already knew that.",
    "My wife says romance is better on vacation. I wish she hadn’t told me via postcard.",
    "I just came across my husband’s Hinge profile, and I can’t believe how he lies. He says he’s 'fun to be around.'",
    "Why do people skip vampire weddings? They suck.",
    "How are marriages like algebra? When you look at your ex, you can’t help but wonder why.",
    "Why did the statue leave her husband? She was tired of being taken for granite."
  ],
  "work": [
    "There are lots of jokes about unemployed people. Sadly, none of them work.",
    "My boss said, 'Have a good day!' So, I went home.",
    "To err is human; to blame others shows management potential.",
    "Why did the guy get fired from the calendar company? He took a day off.",
    "You know what they say about a clean desk? It’s a sign of cluttered drawers.",
    "Why did you leave your last job? The company relocated and didn’t tell me where.",
    "Getting a job at a paperless office is great until you have to go to the bathroom.",
    "I couldn’t work today because of an eye issue. I can’t see myself working here anymore.",
    "I’m famous for my motivational skills. Everyone says they have to work twice as hard when I’m on the team.",
    "When I was interviewed for a job, I was told I would start at $2,000 a month, and then after six months, I’d get $2,500 a month. I told her I would start in six months.",
    "When the HR manager told me to go to hell, I was confused. Did that mean go or stay?",
    "Why is a good doctor able to stay calm? He has a lot of patients.",
    "What’s the best way to criticize your boss? Very quietly, so she can’t hear you.",
    "My boss advised that I start my presentation with a joke. I took a picture of my paycheck for the opening slide.",
    "When asked about my spreadsheet expertise, I always say I Excel at it.",
    "My boss calls me 'the computer' because I fall asleep when unattended after 15 minutes.",
    "My boss told me I was going to see a dramatic increase in my next paycheck. He used a bigger font.",
    "Boss: How come you’re always sick on weekdays? Me: I have a weekend immune system.",
    "Employee: Can I have two weeks off at Christmas? Boss: It’s May. Employee: Sorry. May I have two weeks off at Christmas?",
    "My coworker has never been very successful. When opportunity knocks, he complains about the noise.",
    "Why do I drink coffee at work? I like to do dumb things faster and with more energy.",
    "Why did the marketer dump her boyfriend? Lack of engagement.",
    "I was a dentist for a time, but making myself get to work was like pulling teeth.",
    "I wanted to be a computer programmer, but I couldn’t hack it.",
    "What’s a pirate’s favorite meeting style? A webinarrrrrr.",
    "My biggest issues with meetings is that, despite their name, they're rarely about me.",
    "Hard work pays off later. Laziness pays off now.",
    "My resume is a list of things I hope I never have to do again."
  ],
  "family": [
    "I was raised as an only child. It was very frustrating for my older sister.",
    "When a kid burned down his house, his father watched, put an arm around his wife, and said, 'That’s arson.'",
    "We treat our father like a god. We ignore him until we need something.",
    "I childproofed the house, but they still got in.",
    "I’d love to have kids one day. But that’s about as long as I can handle them.",
    "What do you call headphones that abandon their children? Dead Beats.",
    "My grandfather complained that my generation relies too much on technology, so I unplugged his life support.",
    "What does Nemo have in common with my dad? Neither can be found.",
    "What did the cow say to the leather chair? 'Hi Mom!'",
    "I visited my childhood home and asked if I could come in and take a look at my old room. The homeowners slammed the door in my face. My parents are the worst.",
    "When my Uncle Frank died, he asked to be cremated and placed in his favorite mug. His last wish: To be Frank In Stein.",
    "When does a joke become a dad joke? When it leaves and never comes back.",
    "How many emo kids does it take to screw in a lightbulb? None. They just sit in the dark and cry.",
    "The guy who stole my diary died. My thoughts are with his family.",
    "I’ll never forget my grandfather’s last words to me: 'Are you still holding the ladder?'",
    "When I die, I want to die silently like my grandfather—not like his screaming passengers.",
    "I let my kids vote on dinner. They pick tacos. I make pizza. They don’t live in a swing state.",
    "My mom died when we couldn’t remember her blood type. But she did tell us to 'be positive' before she passed.",
    "Good moms let you lick the beaters. Great moms turn them off first.",
    "It’s not easy being a mom, otherwise dads would do it.",
    "Dad told Mom he wanted to see us every other weekend. She reminded him that they’re still married and he’d have to see us every day.",
    "Who makes the most money off of Father’s Day? Therapists.",
    "Becoming a father is easy. Being one is hard.",
    "Sometimes people say they can’t tell me and my sister apart. Helpful hint: I’m the pretty one.",
    "Having sisters is like living in Cinderella’s house. I’m pretty and overworked; they’re evil.",
    "My twin brother called from prison the other day and asked, 'Hey, do you remember when we used to finish each other’s sentences?'",
    "What do you call a cannibal who keeps taking bites out of his siblings? A munchkin."
  ],
  "dating": [
    "Today was the worst day of my life: My ex got hit by a bus, and I lost my job as a bus driver.",
    "My therapist told me I tend to go after damaged people because I think I can help them. I replied, 'You, too.'",
    "My boyfriend dumped me because he says I’m 'too mysterious.' Or did he?",
    "My girlfriend said nothing would make her happier than getting a ring on her birthday, so I got her nothing.",
    "I was asked what I look for in a relationship. Apparently, 'a way out' was the wrong answer.",
    "The last time I was someone’s type, I was donating blood.",
    "There may be plenty of fish in the sea, but I suck at fishing.",
    "People ask me, 'Why are you single.' My reply: 'I’m overqualified.'",
    "You know that tingly feeling you get when you like someone? That’s common sense leaving your body.",
    "I don’t make mistakes. I date them.",
    "Recipes are like dating sites. The real thing never looks like their pictures.",
    "Not to brag, but I have a date for Valentine’s Day. February 14.",
    "I was told to never date a tennis player. Love means nothing to them.",
    "My girlfriend dated a clown before me. I’ve got some big shoes to fill."
  ],
  "general": [
    "First rule of Vegan Club: You tell everyone about Vegan Club.",
    "What do you call an inexpensive circumcision? A rip-off.",
    "Want to know how to make a legit Caesar salad? Stab the lettuce 23 times.",
    "I don’t have a carbon footprint. I drive everywhere.",
    "Cremation is my final plan to get a smokin’ bod.",
    "Why don’t cannibals eat clowns? They taste funny.",
    "I was shocked when I found out my hairdryer wasn’t waterproof.",
    "You don’t need a parachute to go skydiving. You do need one if you want to go skydiving twice.",
    "The only thing that flat earthers fear is sphere itself."
  ]
}
